# Pandas Walkthrough 

> ### Topics covered :

1.  pandas series
2.  pandas dataframe
3.  missing data
4.  GroupBy operation
5. pandas operation
6. Data input output

##### Pandas relies on some core datastructure for its operation :
*   Series : Dataarray with named index.
*   Dataframe : A Data matrix with labeled index and columns.

## 1) Pandas Series :

A Pandas Series is like a column in a table.

It is a one-dimensional array holding data of any type.

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
#create a list
labels = ['apple','bananna','orange']

weights = [10,34,23]

#create a numpy array 
weights_arr = np.array(weights)

#create a dict
fruits_dict = {'apple':10,'bananna':34,'orange':23}

In [ ]:
#pass a list as data and index as labels
pd.Series(data=weights,index=labels)

apple      10
bananna    34
orange     23
dtype: int64

In [ ]:
#pass a array as data and index as labels
pd.Series(weights_arr,labels)

apple      10
bananna    34
orange     23
dtype: int64

In [ ]:
#pass a dict
pd.Series(fruits_dict)

apple      10
bananna    34
orange     23
dtype: int64

In [ ]:
# create a series
fruits = pd.Series(data=[10,34,23],index=['apple','bananna','orange'])

In [ ]:
#get name with index 
fruits['orange']

23

In [ ]:
#get name 
fruits[10]

'apple'

## 2) Pandas Dataframe :

* A Pandas dataframe is simple multiple pandas series that share the same index

* A Pandas DataFrame is a 2 dimensional data structure, like a 2 dimensional array, or a table with rows and columns.

### 2.1) How to create a DataFrame

In [ ]:
import numpy as np
import pandas as pd

In [ ]:
# create columns 
columns = ['1990','2000','2010','2020']

# create index
index = ['mumbai','goa','pune','delhi','kerela']

In [ ]:
# generate random data
from numpy.random import randint

np.random.seed(42)
data = randint(0,100,(5,4))
data

array([[51, 92, 14, 71],
       [60, 20, 82, 86],
       [74, 74, 87, 99],
       [23,  2, 21, 52],
       [ 1, 87, 29, 37]])

In [ ]:
# create an dataframe
df = pd.DataFrame(data,index=index,columns=columns)
df

        1990  2000  2010  2020
mumbai    51    92    14    71
goa       60    20    82    86
pune      74    74    87    99
delhi     23     2    21    52
kerela     1    87    29    37

### 2.2) Operations on Columns

*   select columns
*   add new columns
*   delete columns

In [ ]:
# select a single column
df['2020']

mumbai    71
goa       86
pune      99
delhi     52
kerela    37
Name: 2020, dtype: int64

In [ ]:
type(df['2020'])

pandas.core.series.Series

In [ ]:
# select more than one columns
df[['1990','2020']]

        1990  2020
mumbai    51    71
goa       60    86
pune      74    99
delhi     23    52
kerela     1    37

In [ ]:
# add a new column
df['new'] = df['1990'] +df['2020']
df

        1990  2000  2010  2020  new
mumbai    51    92    14    71  122
goa       60    20    82    86  146
pune      74    74    87    99  173
delhi     23     2    21    52   75
kerela     1    87    29    37   38

In [ ]:
# Drop a column
#df.drop('new',axis=1)

# Dropping multiple columns , axis = 1 for columns
df = df.drop(['1990','new'],axis=1)
df

        2000  2010  2020
mumbai    92    14    71
goa       20    82    86
pune      74    87    99
delhi      2    21    52
kerela    87    29    37

### 2.3) Operations on Rows


*   select rows
*   select a subset of row and columns

In [ ]:
# select row
df.loc['goa']

1990    60
2000    20
2010    82
2020    86
Name: goa, dtype: int64

In [ ]:
#select multiple rows
df.loc[['mumbai','goa']]

        1990  2000  2010  2020
mumbai    51    92    14    71
goa       60    20    82    86

In [ ]:
# select row by index

#zero index
#df.iloc[0]

#last index
#df.iloc[-1]

#slicing
df.iloc[0:2]

        1990  2000  2010  2020
mumbai    51    92    14    71
goa       60    20    82    86

In [ ]:
# select a subset of rows and columns

# single row and single column
df.loc['goa','2010']

82

In [ ]:
# multiple row single column
df.loc[['goa','kerela'],'2010']

goa       82
kerela    29
Name: 2010, dtype: int64

In [ ]:
# multiple rows and multiple columns
df.loc[['goa','kerela'],['2010','2020']]

        2010  2020
goa       82    86
kerela    29    37

### 2.4) Grab Data based on certain conditions


*   conditions on whole dataframe
*   conditions on specific columns
*   conditions with multiple columns

In [ ]:
# conditions on whole dataframe 
df[df>35]

        1990  2000  2010  2020
mumbai  51.0  92.0   NaN    71
goa     60.0   NaN  82.0    86
pune    74.0  74.0  87.0    99
delhi    NaN   NaN   NaN    52
kerela   NaN  87.0   NaN    37

In [ ]:
# conditions on specific columns
#df[df['2000']>35]

#conditon and then specific columns
df[df['2000']>35]['2020']

mumbai    71
pune      99
kerela    37
Name: 2020, dtype: int64

In [ ]:
# multiple conditions

# AND Operation
df[(df['2000']> 35) &(df['2020']<55)]

        1990  2000  2010  2020
kerela     1    87    29    37

In [ ]:
# OR Operation
df[(df['2000']> 35) | (df['2020']<55)]

        1990  2000  2010  2020
mumbai    51    92    14    71
pune      74    74    87    99
delhi     23     2    21    52
kerela     1    87    29    37

## 3) Handling Missing Data :

Three ways to deal with missing data :

1.   Leave it as missing
2.   Remove the missing data
3.   Fill in the missing data

In [ ]:
# create an dataframe with NaN values 
df_new = df[df>35]
df_new

        1990  2000  2010  2020
mumbai  51.0  92.0   NaN    71
goa     60.0   NaN  82.0    86
pune    74.0  74.0  87.0    99
delhi    NaN   NaN   NaN    52
kerela   NaN  87.0   NaN    37

In [ ]:
# remove the mising data on rows
df_new.dropna()

      1990  2000  2010  2020
pune  74.0  74.0  87.0    99

In [ ]:
# remove the mising data on columns
df_new.dropna(axis=1)

        2020
mumbai    71
goa       86
pune      99
delhi     52
kerela    37

In [ ]:
# remove the mising data on columns with threshold(non null values)
df_new.dropna(axis=1,thresh=3)

        1990  2000  2020
mumbai  51.0  92.0    71
goa     60.0   NaN    86
pune    74.0  74.0    99
delhi    NaN   NaN    52
kerela   NaN  87.0    37

In [ ]:
# fill the values with specific string
df_new.fillna(value='Fill values')

               1990         2000         2010  2020
mumbai           51           92  Fill values    71
goa              60  Fill values           82    86
pune             74           74           87    99
delhi   Fill values  Fill values  Fill values    52
kerela  Fill values           87  Fill values    37

In [ ]:
# fill the values with zero
df_new.fillna(value=0)

        1990  2000  2010  2020
mumbai  51.0  92.0   0.0    71
goa     60.0   0.0  82.0    86
pune    74.0  74.0  87.0    99
delhi    0.0   0.0   0.0    52
kerela   0.0  87.0   0.0    37

In [ ]:
# fill the values with zero for a column
df_new['2000'] = df_new['2000'].fillna(value=0)
df_new

        1990  2000  2010  2020
mumbai  51.0  92.0   NaN    71
goa     60.0   0.0  82.0    86
pune    74.0  74.0  87.0    99
delhi    NaN   0.0   NaN    52
kerela   NaN  87.0   NaN    37

In [ ]:
# fill the values with zero for a column
df_new['2010'] = df_new['2010'].fillna(value=df_new['2010'].mean())
df_new

        1990  2000  2010  2020
mumbai  51.0  92.0  84.5    71
goa     60.0   0.0  82.0    86
pune    74.0  74.0  87.0    99
delhi    NaN   0.0  84.5    52
kerela   NaN  87.0  84.5    37

In [ ]:
# fill the values with mean
df_new.fillna(df.mean())

        1990  2000  2010  2020
mumbai  51.0  92.0  84.5    71
goa     60.0   0.0  82.0    86
pune    74.0  74.0  87.0    99
delhi   41.8   0.0  84.5    52
kerela  41.8  87.0  84.5    37

## 4) GroupBy Operation :

* This process is often reffered to as Split-Apply-Combine
* The operation chosen by GroupBy must me an aggregation method(Sum,Mean,Min,Max etc)

In [3]:
import pandas as pd
import numpy as np
from numpy.random import randint

# create columns 
columns = ['country','city','population']

# create data
np.random.seed(42)
data = [["india",'mumbai',randint(10,500) ],["india",'goa',randint(10,500) ],["usa",'new-york',randint(10,500) ],["france",'paris',randint(10,500) ]]
data

[['india', 'mumbai', 112],
 ['india', 'goa', 445],
 ['usa', 'new-york', 358],
 ['france', 'paris', 280]]

In [4]:
# Create an dataframe
df = pd.DataFrame(data=data,columns=columns)
df.head()

  country      city  population
0   india    mumbai         112
1   india       goa         445
2     usa  new-york         358
3  france     paris         280

In [9]:
# write a groupby
df.groupby("country").sum()

         population
country
france          280
india           557
usa             358

In [14]:
# write a groupby sorted
df.groupby("population").sum().sort_index(ascending=True)

           country      city
population
112          india    mumbai
280         france     paris
358            usa  new-york
445          india       goa

In [16]:
# write a multiple groupby sorted
df.groupby(["country",'city']).sum()

                  population
country city
france  paris            280
india   goa              445
        mumbai           112
usa     new-york         358

In [18]:
# Describe
df.groupby("country").describe()

        population
             count   mean         std    min     25%    50%     75%    max
country
france         1.0  280.0         NaN  280.0  280.00  280.0  280.00  280.0
india          2.0  278.5  235.466558  112.0  195.25  278.5  361.75  445.0
usa            1.0  358.0         NaN  358.0  358.00  358.0  358.00  358.0

## 5) Pandas Operation :

* unique values
* drop duplicates
* Apply to create new columns
* Map to create new columns
* Sort 
* Concat

#### 5.1) unique values

In [36]:
import pandas as pd
import numpy as np
from numpy.random import randint

# create columns 
columns = ['country','city','population']

# create data
np.random.seed(42)
data = [["india",'mumbai',randint(10,500) ],["india",'goa',200 ],["india",'goa',200 ],["usa",'new-york',randint(10,500) ],["france",'paris',randint(10,500) ],["canada",'torento',randint(10,500) ]]

# create an dataframe
df = pd.DataFrame(data=data,columns=columns)
df.head()

  country      city  population
0   india    mumbai         112
1   india       goa         200
2   india       goa         200
3     usa  new-york         445
4  france     paris         358

In [26]:
# unique values
df['country'].unique()

array(['india', 'usa', 'france', 'canada'], dtype=object)

In [27]:
# number of unique values
df['country'].nunique()

4

#### 5.2) drop duplicate values

In [28]:
df.drop_duplicates()

  country      city  population
0   india    mumbai         112
1   india       goa         200
3     usa  new-york         445
4  france     paris         358
5  canada   torento         280

#### 5.3) Apply to create new columns

In [29]:
def grab_first_letter(state):
  return state[0]

In [31]:
df['suf'] = df['city'].apply(grab_first_letter)

In [35]:
df

0    1
1    1
2    1
3    2
4    3
5    4
Name: country, dtype: int64

#### 5.4) Map to create new columns

In [37]:
map = {'india':1,'usa':2,'france':3,'canada':4}

df['cid'] = df['country'].map(map)
df

  country      city  population  cid
0   india    mumbai         112    1
1   india       goa         200    1
2   india       goa         200    1
3     usa  new-york         445    2
4  france     paris         358    3
5  canada   torento         280    4

#### 5.5) Max and Min value

In [40]:
# get max value
df['population'].max()

# get min value
df['population'].min()

112

In [41]:
# get max value index
df['population'].idxmax()

# get min value index
df['population'].idxmin()

0

#### 5.6) Sort by column value

In [46]:
#sort values
df.sort_values('population')

  country      city  population  cid
0   india    mumbai         112    1
1   india       goa         200    1
2   india       goa         200    1
5  canada   torento         280    4
4  france     paris         358    3
3     usa  new-york         445    2

#### 5.7) Concat Two dataframes

In [47]:
import pandas as pd
import numpy as np
from numpy.random import randint

# create columns 
columns = ['country','city','population']

# create data
np.random.seed(42)
data = [["india",'mumbai',randint(10,500) ],["india",'goa',200 ],["india",'goa',200 ],["usa",'new-york',randint(10,500) ],["france",'paris',randint(10,500) ],["canada",'torento',randint(10,500) ]]

# create an dataframe
df_one = pd.DataFrame(data=data,columns=columns)
df_one.head()

  country      city  population
0   india    mumbai         112
1   india       goa         200
2   india       goa         200
3     usa  new-york         445
4  france     paris         358

In [51]:
df_two = pd.DataFrame(data=[1990,2000,2013,2000,1987,1890],columns=['year'])
df_two

   year
0  1990
1  2000
2  2013
3  2000
4  1987
5  1890

In [52]:
# concat
df_merge = pd.concat([df_one,df_two],axis=1)
df_merge

  country      city  population  year
0   india    mumbai         112  1990
1   india       goa         200  2000
2   india       goa         200  2013
3     usa  new-york         445  2000
4  france     paris         358  1987
5  canada   torento         280  1890